// Напишіть функцію, яка сумуватиме сусідні числа
// і пушитиме їх в новий масив.

// const someArr = [22, 11, 34, 5, 12, 13, 14, 15];

// уточнення: складати необхідно перше число з другим, потім друге - з третім,
// третє - з четвертим і так до кінця.
// В результаті функція має повертати масив [33, 45, 39, 17, 25, 27, 29].
const someArr = [22, 11, 34, 5, 12, 13, 14, 15];
function arrSum(arr) {
  const arrNew = [];
  for (let i = 0; i < arr.length - 1; i++) {
    arrNew.push(arr[i] + arr[i + 1]);
  }
  return arrNew;
}
console.log(arrSum(someArr));
